program(1.0)
[buildInfo = dict<tensor<string, []>, tensor<string, []>>({{"coremlc-component-MIL", "3520.4.1"}, {"coremlc-version", "3520.5.1"}, {"coremltools-component-torch", "2.10.0"}, {"coremltools-source-dialect", "TorchScript"}, {"coremltools-version", "9.0"}})]
{
    func main<ios15>(tensor<fp32, [1, 1, ?, ?]> gray) [FlexibleShapeInformation = tuple<tuple<tensor<string, []>, dict<tensor<string, []>, tensor<int32, [?]>>>, tuple<tensor<string, []>, dict<tensor<string, []>, list<tensor<int32, [2]>, ?>>>>((("DefaultShapes", {{"gray", [1, 1, 256, 256]}}), ("RangeDims", {{"gray", [[1, 1], [1, 1], [256, 2048], [256, 2048]]}})))] {
            tensor<int32, []> var_4 = const()[name = tensor<string, []>("op_4"), val = tensor<int32, []>(1)];
            tensor<int32, [4]> var_10_begin_0 = const()[name = tensor<string, []>("op_10_begin_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<int32, [4]> var_10_end_0 = const()[name = tensor<string, []>("op_10_end_0"), val = tensor<int32, [4]>([1, 1, 0, 0])];
            tensor<bool, [4]> var_10_end_mask_0 = const()[name = tensor<string, []>("op_10_end_mask_0"), val = tensor<bool, [4]>([true, true, true, true])];
            tensor<string, []> gray_to_fp16_dtype_0 = const()[name = tensor<string, []>("gray_to_fp16_dtype_0"), val = tensor<string, []>("fp16")];
            tensor<fp16, [1, 1, ?, ?]> gray_to_fp16 = cast(dtype = gray_to_fp16_dtype_0, x = gray)[name = tensor<string, []>("cast_1")];
            tensor<fp16, [1, 1, ?, ?]> var_10_cast_fp16 = slice_by_index(begin = var_10_begin_0, end = var_10_end_0, end_mask = var_10_end_mask_0, x = gray_to_fp16)[name = tensor<string, []>("op_10_cast_fp16")];
            tensor<int32, [4]> var_13 = const()[name = tensor<string, []>("op_13"), val = tensor<int32, [4]>([1, 4, 1, 1])];
            tensor<fp16, [1, 4, ?, ?]> var_14_cast_fp16 = tile(reps = var_13, x = var_10_cast_fp16)[name = tensor<string, []>("op_14_cast_fp16")];
            tensor<fp16, []> var_15_to_fp16 = const()[name = tensor<string, []>("op_15_to_fp16"), val = tensor<fp16, []>(0x0p+0)];
            tensor<fp16, [1, 4, ?, ?]> hint_1_cast_fp16 = mul(x = var_14_cast_fp16, y = var_15_to_fp16)[name = tensor<string, []>("hint_1_cast_fp16")];
            tensor<bool, []> input_139_interleave_0 = const()[name = tensor<string, []>("input_139_interleave_0"), val = tensor<bool, []>(false)];
            tensor<fp16, [1, 5, ?, ?]> input_139_cast_fp16 = concat(axis = var_4, interleave = input_139_interleave_0, values = (gray_to_fp16, hint_1_cast_fp16))[name = tensor<string, []>("input_139_cast_fp16")];
            tensor<int32, []> var_21 = const()[name = tensor<string, []>("op_21"), val = tensor<int32, []>(1)];
            tensor<int32, []> var_25 = const()[name = tensor<string, []>("op_25"), val = tensor<int32, []>(2)];
            tensor<string, []> input0_6_pad_type_0 = const()[name = tensor<string, []>("input0_6_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> input0_6_pad_0 = const()[name = tensor<string, []>("input0_6_pad_0"), val = tensor<int32, [4]>([1, 1, 1, 1])];
            tensor<int32, [2]> input0_6_strides_0 = const()[name = tensor<string, []>("input0_6_strides_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> input0_6_dilations_0 = const()[name = tensor<string, []>("input0_6_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> input0_6_groups_0 = const()[name = tensor<string, []>("input0_6_groups_0"), val = tensor<int32, []>(1)];
            tensor<fp16, [32, 5, 3, 3]> model_generator_to0_0_weight_to_fp16 = const()[name = tensor<string, []>("model_generator_to0_0_weight_to_fp16"), val = tensor<fp16, [32, 5, 3, 3]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(64)))];
            tensor<fp16, [32]> model_generator_to0_0_bias_to_fp16 = const()[name = tensor<string, []>("model_generator_to0_0_bias_to_fp16"), val = tensor<fp16, [32]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(3008)))];
            tensor<fp16, [1, 32, ?, ?]> input0_6_cast_fp16 = conv(bias = model_generator_to0_0_bias_to_fp16, dilations = input0_6_dilations_0, groups = input0_6_groups_0, pad = input0_6_pad_0, pad_type = input0_6_pad_type_0, strides = input0_6_strides_0, weight = model_generator_to0_0_weight_to_fp16, x = input_139_cast_fp16)[name = tensor<string, []>("input0_6_cast_fp16")];
            tensor<fp16, []> var_22_to_fp16 = const()[name = tensor<string, []>("op_22_to_fp16"), val = tensor<fp16, []>(0x1.998p-3)];
            tensor<fp16, [1, 32, ?, ?]> input_141_cast_fp16 = leaky_relu(alpha = var_22_to_fp16, x = input0_6_cast_fp16)[name = tensor<string, []>("input_141_cast_fp16")];
            tensor<string, []> input_123_pad_type_0 = const()[name = tensor<string, []>("input_123_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> input_123_pad_0 = const()[name = tensor<string, []>("input_123_pad_0"), val = tensor<int32, [4]>([1, 1, 1, 1])];
            tensor<int32, [2]> input_123_strides_0 = const()[name = tensor<string, []>("input_123_strides_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> input_123_dilations_0 = const()[name = tensor<string, []>("input_123_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> input_123_groups_0 = const()[name = tensor<string, []>("input_123_groups_0"), val = tensor<int32, []>(1)];
            tensor<fp16, [32, 32, 3, 3]> model_generator_to0_2_weight_to_fp16 = const()[name = tensor<string, []>("model_generator_to0_2_weight_to_fp16"), val = tensor<fp16, [32, 32, 3, 3]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(3136)))];
            tensor<fp16, [32]> model_generator_to0_2_bias_to_fp16 = const()[name = tensor<string, []>("model_generator_to0_2_bias_to_fp16"), val = tensor<fp16, [32]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(21632)))];
            tensor<fp16, [1, 32, ?, ?]> input_123_cast_fp16 = conv(bias = model_generator_to0_2_bias_to_fp16, dilations = input_123_dilations_0, groups = input_123_groups_0, pad = input_123_pad_0, pad_type = input_123_pad_type_0, strides = input_123_strides_0, weight = model_generator_to0_2_weight_to_fp16, x = input_141_cast_fp16)[name = tensor<string, []>("input_123_cast_fp16")];
            tensor<fp16, [1, 32, ?, ?]> input_145_cast_fp16 = leaky_relu(alpha = var_22_to_fp16, x = input_123_cast_fp16)[name = tensor<string, []>("input_145_cast_fp16")];
            tensor<string, []> input_147_pad_type_0 = const()[name = tensor<string, []>("input_147_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> input_147_pad_0 = const()[name = tensor<string, []>("input_147_pad_0"), val = tensor<int32, [4]>([1, 1, 1, 1])];
            tensor<int32, [2]> input_147_strides_0 = const()[name = tensor<string, []>("input_147_strides_0"), val = tensor<int32, [2]>([2, 2])];
            tensor<int32, [2]> input_147_dilations_0 = const()[name = tensor<string, []>("input_147_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> input_147_groups_0 = const()[name = tensor<string, []>("input_147_groups_0"), val = tensor<int32, []>(1)];
            tensor<fp16, [64, 32, 3, 3]> model_generator_to1_0_weight_to_fp16 = const()[name = tensor<string, []>("model_generator_to1_0_weight_to_fp16"), val = tensor<fp16, [64, 32, 3, 3]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(21760)))];
            tensor<fp16, [64]> model_generator_to1_0_bias_to_fp16 = const()[name = tensor<string, []>("model_generator_to1_0_bias_to_fp16"), val = tensor<fp16, [64]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(58688)))];
            tensor<fp16, [1, 64, ?, ?]> input_147_cast_fp16 = conv(bias = model_generator_to1_0_bias_to_fp16, dilations = input_147_dilations_0, groups = input_147_groups_0, pad = input_147_pad_0, pad_type = input_147_pad_type_0, strides = input_147_strides_0, weight = model_generator_to1_0_weight_to_fp16, x = input_145_cast_fp16)[name = tensor<string, []>("input_147_cast_fp16")];
            tensor<fp16, [1, 64, ?, ?]> input_149_cast_fp16 = leaky_relu(alpha = var_22_to_fp16, x = input_147_cast_fp16)[name = tensor<string, []>("input_149_cast_fp16")];
            tensor<string, []> input_125_pad_type_0 = const()[name = tensor<string, []>("input_125_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> input_125_pad_0 = const()[name = tensor<string, []>("input_125_pad_0"), val = tensor<int32, [4]>([1, 1, 1, 1])];
            tensor<int32, [2]> input_125_strides_0 = const()[name = tensor<string, []>("input_125_strides_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> input_125_dilations_0 = const()[name = tensor<string, []>("input_125_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> input_125_groups_0 = const()[name = tensor<string, []>("input_125_groups_0"), val = tensor<int32, []>(1)];
            tensor<fp16, [64, 64, 3, 3]> model_generator_to1_2_weight_to_fp16 = const()[name = tensor<string, []>("model_generator_to1_2_weight_to_fp16"), val = tensor<fp16, [64, 64, 3, 3]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(58880)))];
            tensor<fp16, [64]> model_generator_to1_2_bias_to_fp16 = const()[name = tensor<string, []>("model_generator_to1_2_bias_to_fp16"), val = tensor<fp16, [64]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(132672)))];
            tensor<fp16, [1, 64, ?, ?]> input_125_cast_fp16 = conv(bias = model_generator_to1_2_bias_to_fp16, dilations = input_125_dilations_0, groups = input_125_groups_0, pad = input_125_pad_0, pad_type = input_125_pad_type_0, strides = input_125_strides_0, weight = model_generator_to1_2_weight_to_fp16, x = input_149_cast_fp16)[name = tensor<string, []>("input_125_cast_fp16")];
            tensor<fp16, [1, 64, ?, ?]> input_127_cast_fp16 = leaky_relu(alpha = var_22_to_fp16, x = input_125_cast_fp16)[name = tensor<string, []>("input_127_cast_fp16")];
            tensor<string, []> input_117_pad_type_0 = const()[name = tensor<string, []>("input_117_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> input_117_pad_0 = const()[name = tensor<string, []>("input_117_pad_0"), val = tensor<int32, [4]>([1, 1, 1, 1])];
            tensor<int32, [2]> input_117_strides_0 = const()[name = tensor<string, []>("input_117_strides_0"), val = tensor<int32, [2]>([2, 2])];
            tensor<int32, [2]> input_117_dilations_0 = const()[name = tensor<string, []>("input_117_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> input_117_groups_0 = const()[name = tensor<string, []>("input_117_groups_0"), val = tensor<int32, []>(1)];
            tensor<fp16, [92, 64, 3, 3]> model_generator_to2_0_weight_to_fp16 = const()[name = tensor<string, []>("model_generator_to2_0_weight_to_fp16"), val = tensor<fp16, [92, 64, 3, 3]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(132864)))];
            tensor<fp16, [92]> model_generator_to2_0_bias_to_fp16 = const()[name = tensor<string, []>("model_generator_to2_0_bias_to_fp16"), val = tensor<fp16, [92]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(238912)))];
            tensor<fp16, [1, 92, ?, ?]> input_117_cast_fp16 = conv(bias = model_generator_to2_0_bias_to_fp16, dilations = input_117_dilations_0, groups = input_117_groups_0, pad = input_117_pad_0, pad_type = input_117_pad_type_0, strides = input_117_strides_0, weight = model_generator_to2_0_weight_to_fp16, x = input_127_cast_fp16)[name = tensor<string, []>("input_117_cast_fp16")];
            tensor<fp16, [1, 92, ?, ?]> input_119_cast_fp16 = leaky_relu(alpha = var_22_to_fp16, x = input_117_cast_fp16)[name = tensor<string, []>("input_119_cast_fp16")];
            tensor<string, []> input_129_pad_type_0 = const()[name = tensor<string, []>("input_129_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> input_129_pad_0 = const()[name = tensor<string, []>("input_129_pad_0"), val = tensor<int32, [4]>([1, 1, 1, 1])];
            tensor<int32, [2]> input_129_strides_0 = const()[name = tensor<string, []>("input_129_strides_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> input_129_dilations_0 = const()[name = tensor<string, []>("input_129_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> input_129_groups_0 = const()[name = tensor<string, []>("input_129_groups_0"), val = tensor<int32, []>(1)];
            tensor<fp16, [92, 92, 3, 3]> model_generator_to2_2_weight_to_fp16 = const()[name = tensor<string, []>("model_generator_to2_2_weight_to_fp16"), val = tensor<fp16, [92, 92, 3, 3]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(239168)))];
            tensor<fp16, [92]> model_generator_to2_2_bias_to_fp16 = const()[name = tensor<string, []>("model_generator_to2_2_bias_to_fp16"), val = tensor<fp16, [92]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(391616)))];
            tensor<fp16, [1, 92, ?, ?]> input_129_cast_fp16 = conv(bias = model_generator_to2_2_bias_to_fp16, dilations = input_129_dilations_0, groups = input_129_groups_0, pad = input_129_pad_0, pad_type = input_129_pad_type_0, strides = input_129_strides_0, weight = model_generator_to2_2_weight_to_fp16, x = input_119_cast_fp16)[name = tensor<string, []>("input_129_cast_fp16")];
            tensor<fp16, [1, 92, ?, ?]> input_121_cast_fp16 = leaky_relu(alpha = var_22_to_fp16, x = input_129_cast_fp16)[name = tensor<string, []>("input_121_cast_fp16")];
            tensor<string, []> input_131_pad_type_0 = const()[name = tensor<string, []>("input_131_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> input_131_pad_0 = const()[name = tensor<string, []>("input_131_pad_0"), val = tensor<int32, [4]>([1, 1, 1, 1])];
            tensor<int32, [2]> input_131_strides_0 = const()[name = tensor<string, []>("input_131_strides_0"), val = tensor<int32, [2]>([2, 2])];
            tensor<int32, [2]> input_131_dilations_0 = const()[name = tensor<string, []>("input_131_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> input_131_groups_0 = const()[name = tensor<string, []>("input_131_groups_0"), val = tensor<int32, []>(1)];
            tensor<fp16, [128, 92, 3, 3]> model_generator_to3_0_weight_to_fp16 = const()[name = tensor<string, []>("model_generator_to3_0_weight_to_fp16"), val = tensor<fp16, [128, 92, 3, 3]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(391872)))];
            tensor<fp16, [128]> model_generator_to3_0_bias_to_fp16 = const()[name = tensor<string, []>("model_generator_to3_0_bias_to_fp16"), val = tensor<fp16, [128]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(603904)))];
            tensor<fp16, [1, 128, ?, ?]> input_131_cast_fp16 = conv(bias = model_generator_to3_0_bias_to_fp16, dilations = input_131_dilations_0, groups = input_131_groups_0, pad = input_131_pad_0, pad_type = input_131_pad_type_0, strides = input_131_strides_0, weight = model_generator_to3_0_weight_to_fp16, x = input_121_cast_fp16)[name = tensor<string, []>("input_131_cast_fp16")];
            tensor<fp16, [1, 128, ?, ?]> input_133_cast_fp16 = leaky_relu(alpha = var_22_to_fp16, x = input_131_cast_fp16)[name = tensor<string, []>("input_133_cast_fp16")];
            tensor<string, []> input_135_pad_type_0 = const()[name = tensor<string, []>("input_135_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> input_135_pad_0 = const()[name = tensor<string, []>("input_135_pad_0"), val = tensor<int32, [4]>([1, 1, 1, 1])];
            tensor<int32, [2]> input_135_strides_0 = const()[name = tensor<string, []>("input_135_strides_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> input_135_dilations_0 = const()[name = tensor<string, []>("input_135_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> input_135_groups_0 = const()[name = tensor<string, []>("input_135_groups_0"), val = tensor<int32, []>(1)];
            tensor<fp16, [128, 128, 3, 3]> model_generator_to3_2_weight_to_fp16 = const()[name = tensor<string, []>("model_generator_to3_2_weight_to_fp16"), val = tensor<fp16, [128, 128, 3, 3]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(604224)))];
            tensor<fp16, [128]> model_generator_to3_2_bias_to_fp16 = const()[name = tensor<string, []>("model_generator_to3_2_bias_to_fp16"), val = tensor<fp16, [128]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(899200)))];
            tensor<fp16, [1, 128, ?, ?]> input_135_cast_fp16 = conv(bias = model_generator_to3_2_bias_to_fp16, dilations = input_135_dilations_0, groups = input_135_groups_0, pad = input_135_pad_0, pad_type = input_135_pad_type_0, strides = input_135_strides_0, weight = model_generator_to3_2_weight_to_fp16, x = input_133_cast_fp16)[name = tensor<string, []>("input_135_cast_fp16")];
            tensor<fp16, [1, 128, ?, ?]> aux_out_1_cast_fp16 = leaky_relu(alpha = var_22_to_fp16, x = input_135_cast_fp16)[name = tensor<string, []>("aux_out_1_cast_fp16")];
            tensor<int32, [4]> input0_8_begin_0 = const()[name = tensor<string, []>("input0_8_begin_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<int32, [4]> input0_8_end_0 = const()[name = tensor<string, []>("input0_8_end_0"), val = tensor<int32, [4]>([1, 1, 0, 0])];
            tensor<bool, [4]> input0_8_end_mask_0 = const()[name = tensor<string, []>("input0_8_end_mask_0"), val = tensor<bool, [4]>([true, false, true, true])];
            tensor<fp16, [1, 1, ?, ?]> input0_8_cast_fp16 = slice_by_index(begin = input0_8_begin_0, end = input0_8_end_0, end_mask = input0_8_end_mask_0, x = input_139_cast_fp16)[name = tensor<string, []>("input0_8_cast_fp16")];
            tensor<string, []> input0_10_pad_type_0 = const()[name = tensor<string, []>("input0_10_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> input0_10_pad_0 = const()[name = tensor<string, []>("input0_10_pad_0"), val = tensor<int32, [4]>([3, 3, 3, 3])];
            tensor<int32, [2]> input0_10_strides_0 = const()[name = tensor<string, []>("input0_10_strides_0"), val = tensor<int32, [2]>([2, 2])];
            tensor<int32, [2]> input0_10_dilations_0 = const()[name = tensor<string, []>("input0_10_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> input0_10_groups_0 = const()[name = tensor<string, []>("input0_10_groups_0"), val = tensor<int32, []>(1)];
            tensor<fp16, [64, 1, 7, 7]> const_0_to_fp16 = const()[name = tensor<string, []>("const_0_to_fp16"), val = tensor<fp16, [64, 1, 7, 7]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(899520)))];
            tensor<fp16, [64]> const_1_to_fp16 = const()[name = tensor<string, []>("const_1_to_fp16"), val = tensor<fp16, [64]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(905856)))];
            tensor<fp16, [1, 64, ?, ?]> input_143_cast_fp16 = conv(bias = const_1_to_fp16, dilations = input0_10_dilations_0, groups = input0_10_groups_0, pad = input0_10_pad_0, pad_type = input0_10_pad_type_0, strides = input0_10_strides_0, weight = const_0_to_fp16, x = input0_8_cast_fp16)[name = tensor<string, []>("input_143_cast_fp16")];
            tensor<fp16, [1, 64, ?, ?]> var_132_cast_fp16 = relu(x = input_143_cast_fp16)[name = tensor<string, []>("op_132_cast_fp16")];
            tensor<string, []> input_22_pad_type_0 = const()[name = tensor<string, []>("input_22_pad_type_0"), val = tensor<string, []>("valid")];
            tensor<int32, [2]> input_22_strides_0 = const()[name = tensor<string, []>("input_22_strides_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [4]> input_22_pad_0 = const()[name = tensor<string, []>("input_22_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<int32, [2]> input_22_dilations_0 = const()[name = tensor<string, []>("input_22_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> input_22_groups_0 = const()[name = tensor<string, []>("input_22_groups_0"), val = tensor<int32, []>(1)];
            tensor<fp16, [128, 64, 1, 1]> const_2_to_fp16 = const()[name = tensor<string, []>("const_2_to_fp16"), val = tensor<fp16, [128, 64, 1, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(906048)))];
            tensor<fp16, [128]> const_3_to_fp16 = const()[name = tensor<string, []>("const_3_to_fp16"), val = tensor<fp16, [128]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(922496)))];
            tensor<fp16, [1, 128, ?, ?]> input_24_cast_fp16 = conv(bias = const_3_to_fp16, dilations = input_22_dilations_0, groups = input_22_groups_0, pad = input_22_pad_0, pad_type = input_22_pad_type_0, strides = input_22_strides_0, weight = const_2_to_fp16, x = var_132_cast_fp16)[name = tensor<string, []>("input_24_cast_fp16")];
            tensor<fp16, [1, 128, ?, ?]> var_155_cast_fp16 = relu(x = input_24_cast_fp16)[name = tensor<string, []>("op_155_cast_fp16")];
            tensor<string, []> input_26_pad_type_0 = const()[name = tensor<string, []>("input_26_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> input_26_pad_0 = const()[name = tensor<string, []>("input_26_pad_0"), val = tensor<int32, [4]>([1, 1, 1, 1])];
            tensor<int32, []> input_26_groups_0 = const()[name = tensor<string, []>("input_26_groups_0"), val = tensor<int32, []>(32)];
            tensor<int32, [2]> input_26_strides_0 = const()[name = tensor<string, []>("input_26_strides_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> input_26_dilations_0 = const()[name = tensor<string, []>("input_26_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<fp16, [128, 4, 3, 3]> const_4_to_fp16 = const()[name = tensor<string, []>("const_4_to_fp16"), val = tensor<fp16, [128, 4, 3, 3]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(922816)))];
            tensor<fp16, [128]> const_5_to_fp16 = const()[name = tensor<string, []>("const_5_to_fp16"), val = tensor<fp16, [128]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(932096)))];
            tensor<fp16, [1, 128, ?, ?]> input_28_cast_fp16 = conv(bias = const_5_to_fp16, dilations = input_26_dilations_0, groups = input_26_groups_0, pad = input_26_pad_0, pad_type = input_26_pad_type_0, strides = input_26_strides_0, weight = const_4_to_fp16, x = var_155_cast_fp16)[name = tensor<string, []>("input_28_cast_fp16")];
            tensor<fp16, [1, 128, ?, ?]> var_167_cast_fp16 = relu(x = input_28_cast_fp16)[name = tensor<string, []>("op_167_cast_fp16")];
            tensor<string, []> input_30_pad_type_0 = const()[name = tensor<string, []>("input_30_pad_type_0"), val = tensor<string, []>("valid")];
            tensor<int32, [2]> input_30_strides_0 = const()[name = tensor<string, []>("input_30_strides_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [4]> input_30_pad_0 = const()[name = tensor<string, []>("input_30_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<int32, [2]> input_30_dilations_0 = const()[name = tensor<string, []>("input_30_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> input_30_groups_0 = const()[name = tensor<string, []>("input_30_groups_0"), val = tensor<int32, []>(1)];
            tensor<fp16, [256, 128, 1, 1]> const_6_to_fp16 = const()[name = tensor<string, []>("const_6_to_fp16"), val = tensor<fp16, [256, 128, 1, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(932416)))];
            tensor<fp16, [256]> const_7_to_fp16 = const()[name = tensor<string, []>("const_7_to_fp16"), val = tensor<fp16, [256]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(998016)))];
            tensor<fp16, [1, 256, ?, ?]> input_32_cast_fp16 = conv(bias = const_7_to_fp16, dilations = input_30_dilations_0, groups = input_30_groups_0, pad = input_30_pad_0, pad_type = input_30_pad_type_0, strides = input_30_strides_0, weight = const_6_to_fp16, x = var_167_cast_fp16)[name = tensor<string, []>("input_32_cast_fp16")];
            tensor<int32, [2]> input_34_axes_0 = const()[name = tensor<string, []>("input_34_axes_0"), val = tensor<int32, [2]>([-2, -1])];
            tensor<bool, []> input_34_keep_dims_0 = const()[name = tensor<string, []>("input_34_keep_dims_0"), val = tensor<bool, []>(true)];
            tensor<fp16, [1, 256, 1, 1]> input_34_cast_fp16 = reduce_mean(axes = input_34_axes_0, keep_dims = input_34_keep_dims_0, x = input_32_cast_fp16)[name = tensor<string, []>("input_34_cast_fp16")];
            tensor<string, []> input_36_pad_type_0 = const()[name = tensor<string, []>("input_36_pad_type_0"), val = tensor<string, []>("valid")];
            tensor<int32, [2]> input_36_strides_0 = const()[name = tensor<string, []>("input_36_strides_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [4]> input_36_pad_0 = const()[name = tensor<string, []>("input_36_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<int32, [2]> input_36_dilations_0 = const()[name = tensor<string, []>("input_36_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> input_36_groups_0 = const()[name = tensor<string, []>("input_36_groups_0"), val = tensor<int32, []>(1)];
            tensor<fp16, [16, 256, 1, 1]> model_generator_encoder_layer1_0_selayer_conv1_weight_to_fp16 = const()[name = tensor<string, []>("model_generator_encoder_layer1_0_selayer_conv1_weight_to_fp16"), val = tensor<fp16, [16, 256, 1, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(998592)))];
            tensor<fp16, [16]> model_generator_encoder_layer1_0_selayer_conv1_bias_to_fp16 = const()[name = tensor<string, []>("model_generator_encoder_layer1_0_selayer_conv1_bias_to_fp16"), val = tensor<fp16, [16]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(1006848)))];
            tensor<fp16, [1, 16, 1, 1]> input_36_cast_fp16 = conv(bias = model_generator_encoder_layer1_0_selayer_conv1_bias_to_fp16, dilations = input_36_dilations_0, groups = input_36_groups_0, pad = input_36_pad_0, pad_type = input_36_pad_type_0, strides = input_36_strides_0, weight = model_generator_encoder_layer1_0_selayer_conv1_weight_to_fp16, x = input_34_cast_fp16)[name = tensor<string, []>("input_36_cast_fp16")];
            tensor<fp16, [1, 16, 1, 1]> var_190_cast_fp16 = relu(x = input_36_cast_fp16)[name = tensor<string, []>("op_190_cast_fp16")];
            tensor<string, []> input_38_pad_type_0 = const()[name = tensor<string, []>("input_38_pad_type_0"), val = tensor<string, []>("valid")];
            tensor<int32, [2]> input_38_strides_0 = const()[name = tensor<string, []>("input_38_strides_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [4]> input_38_pad_0 = const()[name = tensor<string, []>("input_38_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<int32, [2]> input_38_dilations_0 = const()[name = tensor<string, []>("input_38_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> input_38_groups_0 = const()[name = tensor<string, []>("input_38_groups_0"), val = tensor<int32, []>(1)];
            tensor<fp16, [256, 16, 1, 1]> model_generator_encoder_layer1_0_selayer_conv2_weight_to_fp16 = const()[name = tensor<string, []>("model_generator_encoder_layer1_0_selayer_conv2_weight_to_fp16"), val = tensor<fp16, [256, 16, 1, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(1006976)))];
            tensor<fp16, [256]> model_generator_encoder_layer1_0_selayer_conv2_bias_to_fp16 = const()[name = tensor<string, []>("model_generator_encoder_layer1_0_selayer_conv2_bias_to_fp16"), val = tensor<fp16, [256]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(1015232)))];
            tensor<fp16, [1, 256, 1, 1]> input_38_cast_fp16 = conv(bias = model_generator_encoder_layer1_0_selayer_conv2_bias_to_fp16, dilations = input_38_dilations_0, groups = input_38_groups_0, pad = input_38_pad_0, pad_type = input_38_pad_type_0, strides = input_38_strides_0, weight = model_generator_encoder_layer1_0_selayer_conv2_weight_to_fp16, x = var_190_cast_fp16)[name = tensor<string, []>("input_38_cast_fp16")];
            tensor<fp16, [1, 256, 1, 1]> var_198_cast_fp16 = sigmoid(x = input_38_cast_fp16)[name = tensor<string, []>("op_198_cast_fp16")];
            tensor<fp16, [1, 256, ?, ?]> var_199_cast_fp16 = mul(x = input_32_cast_fp16, y = var_198_cast_fp16)[name = tensor<string, []>("op_199_cast_fp16")];
            tensor<string, []> input_40_pad_type_0 = const()[name = tensor<string, []>("input_40_pad_type_0"), val = tensor<string, []>("valid")];
            tensor<int32, [2]> input_40_strides_0 = const()[name = tensor<string, []>("input_40_strides_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [4]> input_40_pad_0 = const()[name = tensor<string, []>("input_40_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<int32, [2]> input_40_dilations_0 = const()[name = tensor<string, []>("input_40_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> input_40_groups_0 = const()[name = tensor<string, []>("input_40_groups_0"), val = tensor<int32, []>(1)];
            tensor<fp16, [256, 64, 1, 1]> const_8_to_fp16 = const()[name = tensor<string, []>("const_8_to_fp16"), val = tensor<fp16, [256, 64, 1, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(1015808)))];
            tensor<fp16, [256]> const_9_to_fp16 = const()[name = tensor<string, []>("const_9_to_fp16"), val = tensor<fp16, [256]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(1048640)))];
            tensor<fp16, [1, 256, ?, ?]> residual_2_cast_fp16 = conv(bias = const_9_to_fp16, dilations = input_40_dilations_0, groups = input_40_groups_0, pad = input_40_pad_0, pad_type = input_40_pad_type_0, strides = input_40_strides_0, weight = const_8_to_fp16, x = var_132_cast_fp16)[name = tensor<string, []>("residual_2_cast_fp16")];
            tensor<fp16, [1, 256, ?, ?]> input_42_cast_fp16 = add(x = var_199_cast_fp16, y = residual_2_cast_fp16)[name = tensor<string, []>("input_42_cast_fp16")];
            tensor<fp16, [1, 256, ?, ?]> var_214_cast_fp16 = relu(x = input_42_cast_fp16)[name = tensor<string, []>("op_214_cast_fp16")];
            tensor<string, []> input_44_pad_type_0 = const()[name = tensor<string, []>("input_44_pad_type_0"), val = tensor<string, []>("valid")];
            tensor<int32, [2]> input_44_strides_0 = const()[name = tensor<string, []>("input_44_strides_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [4]> input_44_pad_0 = const()[name = tensor<string, []>("input_44_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<int32, [2]> input_44_dilations_0 = const()[name = tensor<string, []>("input_44_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> input_44_groups_0 = const()[name = tensor<string, []>("input_44_groups_0"), val = tensor<int32, []>(1)];
            tensor<fp16, [128, 256, 1, 1]> const_10_to_fp16 = const()[name = tensor<string, []>("const_10_to_fp16"), val = tensor<fp16, [128, 256, 1, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(1049216)))];
            tensor<fp16, [128]> const_11_to_fp16 = const()[name = tensor<string, []>("const_11_to_fp16"), val = tensor<fp16, [128]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(1114816)))];
            tensor<fp16, [1, 128, ?, ?]> input_46_cast_fp16 = conv(bias = const_11_to_fp16, dilations = input_44_dilations_0, groups = input_44_groups_0, pad = input_44_pad_0, pad_type = input_44_pad_type_0, strides = input_44_strides_0, weight = const_10_to_fp16, x = var_214_cast_fp16)[name = tensor<string, []>("input_46_cast_fp16")];
            tensor<fp16, [1, 128, ?, ?]> var_233_cast_fp16 = relu(x = input_46_cast_fp16)[name = tensor<string, []>("op_233_cast_fp16")];
            tensor<string, []> input_48_pad_type_0 = const()[name = tensor<string, []>("input_48_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> input_48_pad_0 = const()[name = tensor<string, []>("input_48_pad_0"), val = tensor<int32, [4]>([1, 1, 1, 1])];
            tensor<int32, []> input_48_groups_0 = const()[name = tensor<string, []>("input_48_groups_0"), val = tensor<int32, []>(32)];
            tensor<int32, [2]> input_48_strides_0 = const()[name = tensor<string, []>("input_48_strides_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> input_48_dilations_0 = const()[name = tensor<string, []>("input_48_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<fp16, [128, 4, 3, 3]> const_12_to_fp16 = const()[name = tensor<string, []>("const_12_to_fp16"), val = tensor<fp16, [128, 4, 3, 3]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(1115136)))];
            tensor<fp16, [128]> const_13_to_fp16 = const()[name = tensor<string, []>("const_13_to_fp16"), val = tensor<fp16, [128]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(1124416)))];
            tensor<fp16, [1, 128, ?, ?]> input_50_cast_fp16 = conv(bias = const_13_to_fp16, dilations = input_48_dilations_0, groups = input_48_groups_0, pad = input_48_pad_0, pad_type = input_48_pad_type_0, strides = input_48_strides_0, weight = const_12_to_fp16, x = var_233_cast_fp16)[name = tensor<string, []>("input_50_cast_fp16")];
            tensor<fp16, [1, 128, ?, ?]> var_245_cast_fp16 = relu(x = input_50_cast_fp16)[name = tensor<string, []>("op_245_cast_fp16")];
            tensor<string, []> input_52_pad_type_0 = const()[name = tensor<string, []>("input_52_pad_type_0"), val = tensor<string, []>("valid")];
            tensor<int32, [2]> input_52_strides_0 = const()[name = tensor<string, []>("input_52_strides_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [4]> input_52_pad_0 = const()[name = tensor<string, []>("input_52_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<int32, [2]> input_52_dilations_0 = const()[name = tensor<string, []>("input_52_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> input_52_groups_0 = const()[name = tensor<string, []>("input_52_groups_0"), val = tensor<int32, []>(1)];
            tensor<fp16, [256, 128, 1, 1]> const_14_to_fp16 = const()[name = tensor<string, []>("const_14_to_fp16"), val = tensor<fp16, [256, 128, 1, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(1124736)))];
            tensor<fp16, [256]> const_15_to_fp16 = const()[name = tensor<string, []>("const_15_to_fp16"), val = tensor<fp16, [256]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(1190336)))];
            tensor<fp16, [1, 256, ?, ?]> input_54_cast_fp16 = conv(bias = const_15_to_fp16, dilations = input_52_dilations_0, groups = input_52_groups_0, pad = input_52_pad_0, pad_type = input_52_pad_type_0, strides = input_52_strides_0, weight = const_14_to_fp16, x = var_245_cast_fp16)[name = tensor<string, []>("input_54_cast_fp16")];
            tensor<int32, [2]> input_56_axes_0 = const()[name = tensor<string, []>("input_56_axes_0"), val = tensor<int32, [2]>([-2, -1])];
            tensor<bool, []> input_56_keep_dims_0 = const()[name = tensor<string, []>("input_56_keep_dims_0"), val = tensor<bool, []>(true)];
            tensor<fp16, [1, 256, 1, 1]> input_56_cast_fp16 = reduce_mean(axes = input_56_axes_0, keep_dims = input_56_keep_dims_0, x = input_54_cast_fp16)[name = tensor<string, []>("input_56_cast_fp16")];
            tensor<string, []> input_58_pad_type_0 = const()[name = tensor<string, []>("input_58_pad_type_0"), val = tensor<string, []>("valid")];
            tensor<int32, [2]> input_58_strides_0 = const()[name = tensor<string, []>("input_58_strides_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [4]> input_58_pad_0 = const()[name = tensor<string, []>("input_58_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<int32, [2]> input_58_dilations_0 = const()[name = tensor<string, []>("input_58_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> input_58_groups_0 = const()[name = tensor<string, []>("input_58_groups_0"), val = tensor<int32, []>(1)];
            tensor<fp16, [16, 256, 1, 1]> model_generator_encoder_layer1_1_selayer_conv1_weight_to_fp16 = const()[name = tensor<string, []>("model_generator_encoder_layer1_1_selayer_conv1_weight_to_fp16"), val = tensor<fp16, [16, 256, 1, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(1190912)))];
            tensor<fp16, [16]> model_generator_encoder_layer1_1_selayer_conv1_bias_to_fp16 = const()[name = tensor<string, []>("model_generator_encoder_layer1_1_selayer_conv1_bias_to_fp16"), val = tensor<fp16, [16]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(1199168)))];
            tensor<fp16, [1, 16, 1, 1]> input_58_cast_fp16 = conv(bias = model_generator_encoder_layer1_1_selayer_conv1_bias_to_fp16, dilations = input_58_dilations_0, groups = input_58_groups_0, pad = input_58_pad_0, pad_type = input_58_pad_type_0, strides = input_58_strides_0, weight = model_generator_encoder_layer1_1_selayer_conv1_weight_to_fp16, x = input_56_cast_fp16)[name = tensor<string, []>("input_58_cast_fp16")];
            tensor<fp16, [1, 16, 1, 1]> var_268_cast_fp16 = relu(x = input_58_cast_fp16)[name = tensor<string, []>("op_268_cast_fp16")];
            tensor<string, []> input_60_pad_type_0 = const()[name = tensor<string, []>("input_60_pad_type_0"), val = tensor<string, []>("valid")];
            tensor<int32, [2]> input_60_strides_0 = const()[name = tensor<string, []>("input_60_strides_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [4]> input_60_pad_0 = const()[name = tensor<string, []>("input_60_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<int32, [2]> input_60_dilations_0 = const()[name = tensor<string, []>("input_60_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> input_60_groups_0 = const()[name = tensor<string, []>("input_60_groups_0"), val = tensor<int32, []>(1)];
            tensor<fp16, [256, 16, 1, 1]> model_generator_encoder_layer1_1_selayer_conv2_weight_to_fp16 = const()[name = tensor<string, []>("model_generator_encoder_layer1_1_selayer_conv2_weight_to_fp16"), val = tensor<fp16, [256, 16, 1, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(1199296)))];
            tensor<fp16, [256]> model_generator_encoder_layer1_1_selayer_conv2_bias_to_fp16 = const()[name = tensor<string, []>("model_generator_encoder_layer1_1_selayer_conv2_bias_to_fp16"), val = tensor<fp16, [256]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(1207552)))];
            tensor<fp16, [1, 256, 1, 1]> input_60_cast_fp16 = conv(bias = model_generator_encoder_layer1_1_selayer_conv2_bias_to_fp16, dilations = input_60_dilations_0, groups = input_60_groups_0, pad = input_60_pad_0, pad_type = input_60_pad_type_0, strides = input_60_strides_0, weight = model_generator_encoder_layer1_1_selayer_conv2_weight_to_fp16, x = var_268_cast_fp16)[name = tensor<string, []>("input_60_cast_fp16")];
            tensor<fp16, [1, 256, 1, 1]> var_276_cast_fp16 = sigmoid(x = input_60_cast_fp16)[name = tensor<string, []>("op_276_cast_fp16")];
            tensor<fp16, [1, 256, ?, ?]> var_277_cast_fp16 = mul(x = input_54_cast_fp16, y = var_276_cast_fp16)[name = tensor<string, []>("op_277_cast_fp16")];
            tensor<fp16, [1, 256, ?, ?]> input_62_cast_fp16 = add(x = var_277_cast_fp16, y = var_214_cast_fp16)[name = tensor<string, []>("input_62_cast_fp16")];
            tensor<fp16, [1, 256, ?, ?]> var_279_cast_fp16 = relu(x = input_62_cast_fp16)[name = tensor<string, []>("op_279_cast_fp16")];
            tensor<string, []> input_64_pad_type_0 = const()[name = tensor<string, []>("input_64_pad_type_0"), val = tensor<string, []>("valid")];
            tensor<int32, [2]> input_64_strides_0 = const()[name = tensor<string, []>("input_64_strides_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [4]> input_64_pad_0 = const()[name = tensor<string, []>("input_64_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<int32, [2]> input_64_dilations_0 = const()[name = tensor<string, []>("input_64_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> input_64_groups_0 = const()[name = tensor<string, []>("input_64_groups_0"), val = tensor<int32, []>(1)];
            tensor<fp16, [128, 256, 1, 1]> const_16_to_fp16 = const()[name = tensor<string, []>("const_16_to_fp16"), val = tensor<fp16, [128, 256, 1, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(1208128)))];
            tensor<fp16, [128]> const_17_to_fp16 = const()[name = tensor<string, []>("const_17_to_fp16"), val = tensor<fp16, [128]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(1273728)))];
            tensor<fp16, [1, 128, ?, ?]> input_66_cast_fp16 = conv(bias = const_17_to_fp16, dilations = input_64_dilations_0, groups = input_64_groups_0, pad = input_64_pad_0, pad_type = input_64_pad_type_0, strides = input_64_strides_0, weight = const_16_to_fp16, x = var_279_cast_fp16)[name = tensor<string, []>("input_66_cast_fp16")];
            tensor<fp16, [1, 128, ?, ?]> var_298_cast_fp16 = relu(x = input_66_cast_fp16)[name = tensor<string, []>("op_298_cast_fp16")];
            tensor<string, []> input_68_pad_type_0 = const()[name = tensor<string, []>("input_68_pad_type_0"), val = tensor<string, []>("custom")];
            tensor<int32, [4]> input_68_pad_0 = const()[name = tensor<string, []>("input_68_pad_0"), val = tensor<int32, [4]>([1, 1, 1, 1])];
            tensor<int32, []> input_68_groups_0 = const()[name = tensor<string, []>("input_68_groups_0"), val = tensor<int32, []>(32)];
            tensor<int32, [2]> input_68_strides_0 = const()[name = tensor<string, []>("input_68_strides_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [2]> input_68_dilations_0 = const()[name = tensor<string, []>("input_68_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<fp16, [128, 4, 3, 3]> const_18_to_fp16 = const()[name = tensor<string, []>("const_18_to_fp16"), val = tensor<fp16, [128, 4, 3, 3]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(1274048)))];
            tensor<fp16, [128]> const_19_to_fp16 = const()[name = tensor<string, []>("const_19_to_fp16"), val = tensor<fp16, [128]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(1283328)))];
            tensor<fp16, [1, 128, ?, ?]> input_70_cast_fp16 = conv(bias = const_19_to_fp16, dilations = input_68_dilations_0, groups = input_68_groups_0, pad = input_68_pad_0, pad_type = input_68_pad_type_0, strides = input_68_strides_0, weight = const_18_to_fp16, x = var_298_cast_fp16)[name = tensor<string, []>("input_70_cast_fp16")];
            tensor<fp16, [1, 128, ?, ?]> var_310_cast_fp16 = relu(x = input_70_cast_fp16)[name = tensor<string, []>("op_310_cast_fp16")];
            tensor<string, []> input_72_pad_type_0 = const()[name = tensor<string, []>("input_72_pad_type_0"), val = tensor<string, []>("valid")];
            tensor<int32, [2]> input_72_strides_0 = const()[name = tensor<string, []>("input_72_strides_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [4]> input_72_pad_0 = const()[name = tensor<string, []>("input_72_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<int32, [2]> input_72_dilations_0 = const()[name = tensor<string, []>("input_72_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> input_72_groups_0 = const()[name = tensor<string, []>("input_72_groups_0"), val = tensor<int32, []>(1)];
            tensor<fp16, [256, 128, 1, 1]> const_20_to_fp16 = const()[name = tensor<string, []>("const_20_to_fp16"), val = tensor<fp16, [256, 128, 1, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(1283648)))];
            tensor<fp16, [256]> const_21_to_fp16 = const()[name = tensor<string, []>("const_21_to_fp16"), val = tensor<fp16, [256]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(1349248)))];
            tensor<fp16, [1, 256, ?, ?]> input_74_cast_fp16 = conv(bias = const_21_to_fp16, dilations = input_72_dilations_0, groups = input_72_groups_0, pad = input_72_pad_0, pad_type = input_72_pad_type_0, strides = input_72_strides_0, weight = const_20_to_fp16, x = var_310_cast_fp16)[name = tensor<string, []>("input_74_cast_fp16")];
            tensor<int32, [2]> input_76_axes_0 = const()[name = tensor<string, []>("input_76_axes_0"), val = tensor<int32, [2]>([-2, -1])];
            tensor<bool, []> input_76_keep_dims_0 = const()[name = tensor<string, []>("input_76_keep_dims_0"), val = tensor<bool, []>(true)];
            tensor<fp16, [1, 256, 1, 1]> input_76_cast_fp16 = reduce_mean(axes = input_76_axes_0, keep_dims = input_76_keep_dims_0, x = input_74_cast_fp16)[name = tensor<string, []>("input_76_cast_fp16")];
            tensor<string, []> input_78_pad_type_0 = const()[name = tensor<string, []>("input_78_pad_type_0"), val = tensor<string, []>("valid")];
            tensor<int32, [2]> input_78_strides_0 = const()[name = tensor<string, []>("input_78_strides_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [4]> input_78_pad_0 = const()[name = tensor<string, []>("input_78_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<int32, [2]> input_78_dilations_0 = const()[name = tensor<string, []>("input_78_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> input_78_groups_0 = const()[name = tensor<string, []>("input_78_groups_0"), val = tensor<int32, []>(1)];
            tensor<fp16, [16, 256, 1, 1]> model_generator_encoder_layer1_2_selayer_conv1_weight_to_fp16 = const()[name = tensor<string, []>("model_generator_encoder_layer1_2_selayer_conv1_weight_to_fp16"), val = tensor<fp16, [16, 256, 1, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(1349824)))];
            tensor<fp16, [16]> model_generator_encoder_layer1_2_selayer_conv1_bias_to_fp16 = const()[name = tensor<string, []>("model_generator_encoder_layer1_2_selayer_conv1_bias_to_fp16"), val = tensor<fp16, [16]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(1358080)))];
            tensor<fp16, [1, 16, 1, 1]> input_78_cast_fp16 = conv(bias = model_generator_encoder_layer1_2_selayer_conv1_bias_to_fp16, dilations = input_78_dilations_0, groups = input_78_groups_0, pad = input_78_pad_0, pad_type = input_78_pad_type_0, strides = input_78_strides_0, weight = model_generator_encoder_layer1_2_selayer_conv1_weight_to_fp16, x = input_76_cast_fp16)[name = tensor<string, []>("input_78_cast_fp16")];
            tensor<fp16, [1, 16, 1, 1]> var_333_cast_fp16 = relu(x = input_78_cast_fp16)[name = tensor<string, []>("op_333_cast_fp16")];
            tensor<string, []> input_80_pad_type_0 = const()[name = tensor<string, []>("input_80_pad_type_0"), val = tensor<string, []>("valid")];
            tensor<int32, [2]> input_80_strides_0 = const()[name = tensor<string, []>("input_80_strides_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, [4]> input_80_pad_0 = const()[name = tensor<string, []>("input_80_pad_0"), val = tensor<int32, [4]>([0, 0, 0, 0])];
            tensor<int32, [2]> input_80_dilations_0 = const()[name = tensor<string, []>("input_80_dilations_0"), val = tensor<int32, [2]>([1, 1])];
            tensor<int32, []> input_80_groups_0 = const()[name = tensor<string, []>("input_80_groups_0"), val = tensor<int32, []>(1)];
            tensor<fp16, [256, 16, 1, 1]> model_generator_encoder_layer1_2_selayer_conv2_weight_to_fp16 = const()[name = tensor<string, []>("model_generator_encoder_layer1_2_selayer_conv2_weight_to_fp16"), val = tensor<fp16, [256, 16, 1, 1]>(BLOBFILE(path = tensor<string, []>("@model_path/weights/weight.bin"), offset = tensor<uint64, []>(1358208)))];
